-- Вариант 9981
-- 1
select "ИМЯ", "ДАТА" from "Н_ЛЮДИ" л
    join "Н_СЕССИЯ" с on л."ИД" = с."ЧЛВК_ИД"
where л."ИМЯ" > 'Александр' and
        с."УЧГОД" = ('2001/2002') and
        с."УЧГОД" < ('2008/2009');
-- 2
select л."ИД", в."ЧЛВК_ИД", с."ИД" from "Н_ЛЮДИ" л
    right join "Н_ВЕДОМОСТИ" в on л."ИД" = в."ЧЛВК_ИД"
    right join "Н_СЕССИЯ" с on л."ИД" = с."ЧЛВК_ИД"
where л."ИМЯ" < 'Николай' and
      в."ЧЛВК_ИД" = 153285;
-- 3
select count(*) from "Н_УЧЕНИКИ" у
    join "Н_ЛЮДИ" л on у."ЧЛВК_ИД" = л."ИД"
where "ГРУППА" like '3102' and
      (DATE_PART('year', AGE("ДАТА_РОЖДЕНИЯ")) >= 25);
-- 4
select "ГРУППА", count(*) from "Н_УЧЕНИКИ" у
    join "Н_ПЛАНЫ" USING ("ИД")
    join "Н_ОТДЕЛЫ" USING ("ОТД_ИД")
where у."КОГДА_СОЗДАЛ" > '01.01.2011'::date and
    "КОНЕЦ_ПО_ПРИКАЗУ" < '31.12.2011'::date and
    "КОРОТКОЕ_ИМЯ" in (
        select "КОРОТКОЕ_ИМЯ" from "Н_ОТДЕЛЫ"
        where "ОТД_ИД" = (
            select "ИД" from "Н_ОТДЕЛЫ"
            where "КОРОТКОЕ_ИМЯ" = 'КТиУ'
        )
    )
group by "ГРУППА"
having count(*) = 10;
-- 5
select у."ЧЛВК_ИД" as "НОМЕР", "ИМЯ", "ФАМИЛИЯ", "ОТЧЕСТВО", avg("ОЦЕНКА"::int) as "СР_ОЦЕНКА" from "Н_УЧЕНИКИ" у
    join "Н_ЛЮДИ" л on у."ЧЛВК_ИД" = л."ИД"
    join "Н_ВЕДОМОСТИ" в on л."ИД" = в."ЧЛВК_ИД"
where ("ОЦЕНКА" ~'^[0-5]') and "ОЦЕНКА"::int > (
    select min("ОЦЕНКА"::int) as "ОЦЕНКА" from "Н_ЛЮДИ" л
        join "Н_УЧЕНИКИ" у on л."ИД" = у."ЧЛВК_ИД"
        join "Н_ВЕДОМОСТИ" в on л."ИД" = в."ЧЛВК_ИД"
    where "ГРУППА" = '3100' and "ОЦЕНКА" ~'^[0-5]')
group by "НОМЕР", л."ИМЯ", л."ФАМИЛИЯ", л."ОТЧЕСТВО";
-- 6
--https://stackoverflow.com/questions/7118170/sql-server-select-only-the-rows-with-maxdate
select "ГРУППА", "НОМЕР", "СОСТОЯНИЕ", "ИМЯ", "ФАМИЛИЯ", "ОТЧЕСТВО", "НОМЕР_ПЛАНА", "ДАТА_УТВЕРЖДЕНИЯ" from
    (select "ГРУППА", "ЧЛВК_ИД" as "НОМЕР", "СОСТОЯНИЕ", "ИМЯ", "ФАМИЛИЯ", "ОТЧЕСТВО", п."ИД" as "НОМЕР_ПЛАНА",
            "ДАТА_УТВЕРЖДЕНИЯ", row_number() over
                (partition by "ИМЯ", "ФАМИЛИЯ", "ОТЧЕСТВО" order by "ДАТА_УТВЕРЖДЕНИЯ" desc) as rn from "Н_УЧЕНИКИ" у
        join "Н_ЛЮДИ" л on л."ИД" = у."ЧЛВК_ИД"
        join "Н_ПЛАНЫ" п on п."ИД" = у."ПЛАН_ИД"
        join "Н_ФОРМЫ_ОБУЧЕНИЯ" ф on ф."ИД" = п."ФО_ИД"
        join "Н_НАПРАВЛЕНИЯ_СПЕЦИАЛ" н on н."ИД" = п."НАПС_ИД"
        join "Н_НАПР_СПЕЦ" нс on н."НС_ИД" = нс."ИД"
    where "ДАТА_УТВЕРЖДЕНИЯ" < '01.09.2012'::date and нс."НАИМЕНОВАНИЕ" = 'Программная инженерия') as t
where rn = 1;
-- 7
select count(*) from (
    select "ИМЯ", "ФАМИЛИЯ", "ОТЧЕСТВО", avg("ОЦЕНКА"::int) as "СР_ОЦЕНКА" from "Н_УЧЕНИКИ" у
        join "Н_ЛЮДИ" л on у."ЧЛВК_ИД" = л."ИД"
        join "Н_ВЕДОМОСТИ" в on л."ИД" = в."ЧЛВК_ИД"
    where ("ОЦЕНКА" ~'^[0-5]')
    group by л."ИМЯ", л."ФАМИЛИЯ", л."ОТЧЕСТВО") as t
where "СР_ОЦЕНКА" = '5';